app/controllers/articles_controller.rb

    def create
        # render plain: params[:article].inspect
        # raise params.inspect
        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ba"], ["text", "が"], ["created_at", "2020-03-15 10:45:45.570486"], ["updated_at", "2020-03-15 10:45:45.570486"]]

    def update

        if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "badgage"], ["text", "がgi\r\n"], ["updated_at", "2020-03-15 12:00:17.800047"], ["id", 1]]